# f's Dotfiles Dependencies
# Apply with: brew bundle --file=Brewfile

tap "homebrew/core"
tap "homebrew/cask"

# Core utilities
brew "chezmoi"
brew "sheldon"
brew "starship"
brew "fzf"
brew "zoxide"

# Rust CLI Replacements
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "dust"
brew "procs"
brew "bottom"

# Git / Workflow
brew "lazygit"
brew "gh"
brew "git-delta"

# Terminal (Cask)
cask "ghostty"
